# Options
cask_args appdir: '~/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'

##################
# Casks
##################

cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'keepassx'
cask 'sketch'
cask 'visual-studio-code'
cask 'font-fira-code'
cask 'spotify'
cask 'discord'
cask 'rectangle'
cask 'kitty'
cask 'tableplus'

##################
# Brews
##################

# Shell
    brew 'reattach-to-user-namespace'
    brew 'tmux'
    brew 'trash'
    brew 'zsh'
    brew 'neovim'
    brew 'exa'
    brew 'ripgrep'
    brew 'batcat'

# Git
    brew 'git'
    brew 'gh'

# JavaScript
    brew 'n'
    brew 'deno'

# Lua
    brew 'stylua'

# Go
    brew 'go'

# Database
    brew 'sqlite'
