# Options
cask_args appdir: '~/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'

##################
# Casks
##################

cask 'google-chrome'
cask 'keepassx'
cask 'visual-studio-code'
cask 'spotify'
cask 'discord'
cask 'rectangle'
cask 'ghostty'
cask 'tableplus'
cask 'font-geist-mono-nerd-font'

##################
# Brews
##################

# Shell
    brew 'reattach-to-user-namespace'
    brew 'tmux'
    brew 'trash'
    brew 'zsh'
    brew 'neovim'
    brew 'eza'
    brew 'ripgrep'

# Git
    brew 'git'
    brew 'gh'

# JavaScript
    brew 'n'

# PHP
    brew 'php'

# Lua
    brew 'stylua'

# Database
    brew 'sqlite'
